views/desempeno/_form.php

SELECT * FROM [subcompetencia]
---

    <!--<?= $form->field($model, 'idSubcompetenciaFk')->textInput() ?>-->

	<!--Lista desplegable-->
	<?php $dataCategory=ArrayHelper::map(\app\models\Subcompetencia::find()->asArray()->all(), 'id', 'descripcion'); ?>