views/layouts/main.php

SELECT * FROM [competencia]
---


						<?php
						$competencias = Competencia::find()->all();