controllers/DesempenoController.php

INSERT INTO [desempeno] ([id], [descripcion], [idSubcompetenciaFk]) VALUES (1, 'eje', 1)
---
    public function actionCreate()
    {
        $model = new Desempeno();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM [desempeno] WHERE [id]='1'
---
    protected function findModel($id)
    {
        if (($model = Desempeno::findOne($id)) !== null) {