controllers/IndicadorController.php

INSERT INTO [indicador] ([id], [descripcion], [idNivelIndicadorFk], [idDesempenoFk]) VALUES (1, 'hola', 1, 1)
---
    public function actionCreate()
    {
        $model = new Indicador();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM [indicador] WHERE [id]='1'
---
    protected function findModel($id)
    {
        if (($model = Indicador::findOne($id)) !== null) {