controllers/NivelindicadorController.php

INSERT INTO [nivelindicador] ([id], [descripcion]) VALUES (1, 'Novato')
---
    public function actionCreate()
    {
        $model = new Nivelindicador();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM [nivelindicador] WHERE [id]='3'
---
    protected function findModel($id)
    {
        if (($model = Nivelindicador::findOne($id)) !== null) {