views/site/index.php

SELECT * FROM [competencia]
---
						<div>
							<ul class="ace-thumbnails clearfix">
								<?php
								$competencias = Competencia::find()->all();