views/indicador/_form.php

SELECT * FROM [nivelindicador]
---

    <!--<?= $form->field($model, 'idNivelIndicadorFk')->textInput() ?>-->

	<!--Lista desplegable-->
	<?php $dataCategory=ArrayHelper::map(\app\models\Nivelindicador::find()->asArray()->all(), 'id', 'descripcion'); ?>

SELECT * FROM [desempeno]
---

    <!--<?= $form->field($model, 'idDesempenoFk')->textInput() ?>-->

	<!--Lista desplegable-->
	<?php $dataCategory=ArrayHelper::map(\app\models\Desempeno::find()->asArray()->all(), 'id', 'descripcion'); ?>